Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum
The directions of a load group.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum.DIRECTION_X
The X direction.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum.DIRECTION_Y
The Y direction.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum.DIRECTION_Z
The Z direction.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum.DIRECTION_NEGATIVE_X
The negative X direction.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum.DIRECTION_NEGATIVE_Y
The negative Y direction.

Tekla.Structures.Analysis.AnalysisLoadGroup.LoadGroupDirectionEnum.DIRECTION_NEGATIVE_Z
The negative Z direction.